[
  {
    "content": "Upon attending the interest meeting, I discovered that in the CyberPatriot competition, teams compete by finding cybersecurity vulnerabilities within the images and hardening the system while maintaining critical services in a six hour period. This is a new experience for me because I get to learn about cybersecurity and fix vulnerabilities in a team environment. I am interested in computer science and cyber security. Also, I may pursue cyber security as a career in the future, given that cyber security is a global issue of the 21st century. I intend to develop skills like working in a team environment, and learning about the complexities of operating system vulnerabilities through this activity.</span><br><img src=\"images/image4.png\">",
    "dates": [
      1536300000000
    ],
    "title": "CyberPatriots Interest Meeting",
    "hours": 1,
    "outcomes": [
      1,
      6,
      7
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "<span>In the previous year, I applied to be a mentor with my school’s student engagement team (SET). </span><span class=\"c10\">This was my first event with my mentee</span><span>.</span><span class=\"c10\">&nbsp;</span><span>The SET tea party is a tradition at my school, and we went and got some iced tea while also getting to know one another better. This also was a great opportunity for my mentee to meet new friends in his grade. I</span>t really was a great start to our mentorship!<br><br><img src=\"images/image5.png\"/>",
    "dates": [
      1536300000000
    ],
    "title": "SET Tea Party!",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4,
      6,
      7
    ],
    "type": "service",
    "experience": "Student Engagement Team Mentorship"
  },
  {
    "content": "Today was the first round of CyberPatriots and was the first time I met my team all in one sitting in person. Since this was a practice round, our team had a nice and relaxed meeting. I learned about documentation, a vital process, in case we break a computer image. Which almost did happen, however, we managed to learn how to repair the computer. I learned that sometimes when securing a computer, it can become so secure that is is very difficult to usable. Thus, as a competitor in this international cybersecurity competition, it is important to balance security and usability. We managed to score 90 points on the Windows image, not bad for our first round.",
    "dates": [
      1537596000000
    ],
    "title": "CyberPatriots Practice Round",
    "hours": 6,
    "outcomes": [
      1,
      2,
      5,
      6
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "This was my first swimming lesson in several years. I remember getting stuck at Red Cross’ Swim Kids level 4 several years ago. It was a really refreshing to be able to enter the water again, and I look forward to improving my abilities. I hope that swimming will provide some time to relax to my weeks, as well as provide some physical activity. For these two swimming lessons I worked on flutter kick as well as front crawl. Through practice I seemed to be improving.",
    "dates": [
      1537682400000,
      1538287200000
    ],
    "title": "Swimming",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "picoCTF 2018 is a competitive online cybersecurity capture the flag game. This was a rewarding experience as it allowed me to develop many skills centered around reverse engineering, hacking, and decrypting in order to solve the many challenges. This experience was an opportunity for us to explore the other side of the global issue of cyber security, cyber attacking. It was also interesting to learn about the ethics related to hacking. Essentially, there is a distinction between white hat hacking which is ethical and used to protect and secure systems and black hat hacking where hacking is used unethically to cause harm. I worked with my CyberPatriots team and we wrote documentation to communicate with each other exactly what we had done. In the end, through our hard work our team ranked top 20 in Canada.<br><br><img alt=\"\" src=\"images/image17.png\" title=\"\"><img alt=\"\" src=\"images/image9.png\" title=\"\">",
    "dates": [
      1538028000000
    ],
    "title": "picoCTF 2018",
    "hours": 6,
    "outcomes": [
      1,
      2,
      5,
      6,
      7
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "For the second Student Engagement Team (SET) event, my mentee and I had a great time playing the four corners game. We got to know one another and the school community more. It was a delightful experience that allowed me to realize the importance of building strong relationships within the school community to creating a welcoming environment.<br><br><img src=\"images/image14.png\"/>",
    "dates": [
      1538632800000
    ],
    "title": "Four Corners SET Event",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4,
      6,
      7
    ],
    "type": "service",
    "experience": "Student Engagement Team Mentorship"
  },
  {
    "content": "After the Thanksgiving weekend break from swimming, I saw a minor decline in my swimming performance. I realized then the importance of exercise to maintain a healthy body. Today we worked on back glide, something that I was fairly good at already, but with the advice from my swimming instructor I was able to do it much more efficiently. Through practice I can see gradual improvement take place.",
    "dates": [
      1539496800000
    ],
    "title": "Swimming",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "<span>Today was the first reading buddies meeting. Together, along with</span><span>&nbsp;</span><span>eight other volunteers, we walked over from my school to a nearby elementary school, and I got paired with a </span><span>student</span>&nbsp;in grade two. I was delightfully surprised to see that he was a fairly good reader already, having letting him choose a book, which he then sped through. I had him choose a harder book and we started to work on longer words with more difficult pronunciations. I found this first session of reading buddies to be fun and I think that this program benefits both reading buddies. With my strengths, I am able to help my reading buddy learn new vocabulary. An area to grow would be learning to interact with children and understand them more. What a delightful experience to be able to contribute to the global issue of literacy.",
    "dates": [
      1539756000000
    ],
    "title": "Reading Buddies",
    "hours": 1,
    "outcomes": [
      1,
      4,
      6
    ],
    "type": "service",
    "experience": "Reading Buddies"
  },
  {
    "content": "This was another training round for the CyberPatriots competition, and from this round I learned about the importance of teamwork, as it would not be possible for a single person to be able to secure several computer images, in only six hours. Furthermore, we worked on our communication, and tried strategies such as rotating between images, so that a fresh set of eyes can look for vulnerabilities every once in a while. Personally, I found that my strengths was in Windows and by rotating to a Linux image, it was clear that learning how the secure Linux would be an area of growth. Overall, as a team we did considerably well, scoring 1oo points on securing Windows 10 and 100 points on Windows Server 2016, and 92 points on Debian. &nbsp;<br><img src=\"images/image15.png\"/>",
    "dates": [
      1540101600000
    ],
    "title": "CyberPatriots Training Round",
    "hours": 7,
    "outcomes": [
      1,
      2,
      4,
      5
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "In these two weeks of swimming, we learned some dives. Turns out I’m pretty bad at diving, and I kept belly flopping. However, I will not give up and will keep persevering until I get it, if kids much younger than I can do it, so can I! From the advice from my instructor, I am slowly improving my diving process. In addition, my front and back swims are doing fairly good as well.",
    "dates": [
      1540101600000
    ],
    "title": "Swimming",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "Today we read more books, alternating between him reading to me and me reading to him. While reading he would sometimes tell me stories about his life, and I found it interesting to be able to get to know him better. After reading, I would ask him a few reading comprehension questions to help him remember what he read. In between reading books, I have been getting to know him better by spending more time talking to him. Overall, this week I have gotten to become friends with my reading buddy.",
    "dates": [
      1540360800000
    ],
    "title": "Reading Buddies",
    "hours": 1,
    "outcomes": [
      1,
      4,
      6
    ],
    "type": "service",
    "experience": "Reading Buddies"
  },
  {
    "content": "This round was the first scored round in the CyberPatriot competition. With all the practice rounds we did before, we found this round relatively easy and we took our time and wrote good documentation. The forensics questions were a challenge, but through working together we found out how to do them. After the competition, we looked at the scoreboard and we noticed that other teams were scoring a large number of points within the first half an hour, and we concluded that they used scripts to automate parts of securing the computer. We decided that this was a vast area of growth that would allow us to remain competitive. Personally I set forth to learn how to and develop some scripts. We scored 100 points on the Windows image, 100 points on the Ubuntu image and 19/20 as our CISCO score. This placed us 4th in the world and first in Canada, what an amazing start to the competition! <br><br><img src=\"images/image28.png\"/>",
    "dates": [
      1541224800000
    ],
    "title": "CyberPatriots Qualifications Round 1",
    "hours": 7,
    "outcomes": [
      1,
      2,
      4,
      5
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "Once again I had another swimming lesson. In this lesson I got a chance to know the other swimmers in my class more, while we played games. In addition, we worked on our diving again, and I became noticeably better at it, no longer splatting into the water, but entering it much more smoothly. Today, we also worked on treading water, which is a difficult way of floating, that requires concentration and effort to effectively stand in water.",
    "dates": [
      1541311200000
    ],
    "title": "Swimming",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "To me my reading buddy seems much more relaxed around me than in the first few weeks of reading buddies. I am glad that he is enjoying it as much as I am! From reading buddies, my buddy has learned quite a few new words and pronunciations. The reading buddies program appears to be a great solution to global issues involving literacy. ",
    "dates": [
      1541574000000
    ],
    "title": "Reading Buddies",
    "hours": 1,
    "outcomes": [
      1,
      4,
      6
    ],
    "type": "service",
    "experience": "Reading Buddies"
  },
  {
    "content": "In these two swimming lessons, I improved my water treading and was able to tread for an entire minute. In the second week, we measured our distance swim as this session of swimming lessons was coming to a close. I think that overall, I have improved significantly since the beginning of swimming lessons, and I have also enjoyed it because it was a good relaxing time compared to school.",
    "dates": [
      1542524400000,
      1543129200000
    ],
    "title": "Swimming",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "In this SET Event, I played link up dodgeball with my mentee. I once again got to get to know my mentee better. We managed to overcome the limitations of linking up arms together by working together, and coordinating our movement strategically. We survived for fairly long and overall it was a very fun time. It was a bit slippery, icy outside, so if I were to do this event, I would try to take the weather into consideration, or even do it inside to make sure no one gets hurt. Overall, this event was very fun and served as a fun break from the stress of school for everyone.<br><br><img src=\"images/image10.jpg\"/>",
    "dates": [
      1542697200000
    ],
    "title": "Link Up Dodgeball SET Event",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4,
      6,
      7
    ],
    "type": "service",
    "experience": "Student Engagement Team Mentorship"
  },
  {
    "content": "My reading buddy graduated! And today he thanked me before heading off, and I got a new reading buddy who was Asian and was quite quiet at first. However, after some light conversation and reading she warmed up to me. Across the world there are so many languages, and thus reading buddies provides me the opportunity to help her improve her literacy.",
    "dates": [
      1542783600000
    ],
    "title": "Reading Buddies",
    "hours": 1,
    "outcomes": [
      1,
      4,
      6
    ],
    "type": "service",
    "experience": "Reading Buddies"
  },
  {
    "content": "This week was the last week of swimming lessons for Swim Kids 4. I am proud to say that I passed and will be continuing onwards with Swim Kids 5 in the next set of swimming lessons. This experience has taught me a lot about my strengths and areas to improve. An area of improvement that I worked on. Was becoming more comfortable in the water as well as learning how to swim for longer distances with a variety of methods and more efficiently. An area of strength I discovered was that the same willingness to learn I apply to school, can also be applied to physical activities like swimming. Through perseverance and practice I was able to improve my swimming abilities significantly. Throughout this experience, I have been learning new skills, and even swimming for longer distances than necessary.<img src=\"images/image20.jpg\"/><img src=\"images/image1.png\"/><img src=\"images/image13.jpg\"/>",
    "dates": [
      1543734000000
    ],
    "title": "Swimming",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "Unfortunately, the reading buddies program came to a conclusion for the semester and I felt sad that I would not be able to join next semester’s due to my school timetable. Today, for the last session of the year, we enjoyed our time reading together. Through these experiences, I learned that reaching out into the community with service is not only a great way to form new friendships, and make an impact on my buddies, but also learn how rewarding it is to give back to the community. An improvement I would make to the program, is increasing either the frequency or duration of sessions, as I wish I could have had more than the six sessions I had with my buddies. It was really meaningful to me to be able to help out two young children in their reading and pronunciation. These literacy skills will help them throughout their lifetimes, I am glad I got to contribute to the global problem of literacy. Below are pictures of the thank you cards our reading buddies sent to us volunteers. <br><br><img src=\"images/image39.jpg\"/><img src=\"images/image38.jpg\"/><img src=\"images/image19.jpg\"/><img src=\"images/image7.png\"/>",
    "dates": [
      1543993200000,
      1544598000000
    ],
    "title": "Reading Buddies",
    "hours": 2,
    "outcomes": [
      1,
      4,
      6
    ],
    "type": "service",
    "experience": "Reading Buddies"
  },
  {
    "content": "This was our second scored round in the CyberPatriots competition, this time we only scored 94 points on Windows 10, 96 points on Windows 8, and 90 points on Ubuntu. During the competition, we created good documentation, which rescued us when we had to restart one of the images, which reset its score, using the documentation we were able to quickly recover our score. These scores are very impressive, however, it is clear that there is more room for us to improve, as a team we decided to continue to look into scripting to improve our process. We qualified into the Platinum division, which is the highest one and I believe that with even more effort our team could make it to semifinals.<br><br><img src=\"images/image29.png\"/>",
    "dates": [
      1544252400000
    ],
    "title": "CyberPatriots Qualifications Round 2",
    "hours": 7,
    "outcomes": [
      1,
      2,
      4,
      5
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "We scored 70 points on Windows Server 2016, 56 points on Ubuntu 16, and 65 points on Windows 10. Unfortunately, we got a penalty on the Windows 10 image, for future rounds we noted that we would have to be more careful to not secure the computer to the extent that the scoring mechanism stops working. In addition, this was the first round we used a script, and it went fairly well, taking care of the smaller tasks, and freeing us to spend more time on solving more difficult problems on Windows 10. Initially, the script broke Windows 10, however, I quickly managed to fix the script and restore our points given that I had written great documentation. We finished sixth in Canada, however as our team was in the top 25% of the Platinum division we were able to advance to Semifinals!<br><br><img src=\"images/image21.png\"/>",
    "dates": [
      1547276400000
    ],
    "title": "CyberPatriots State Round",
    "hours": 7,
    "outcomes": [
      1,
      2,
      4,
      5
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "For the first and second week of Swim Kids 5, we mostly focused on improving our front crawl and back crawl. There was a noticeable increase in difficulty, as we had to swim double the previous distance, however I found it to be an intriguing challenge.",
    "dates": [
      1547362800000,
      1547967600000
    ],
    "title": "Swimming",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "For the third and fourth week of Swim Kids 5, we had to tread water for an entire minute, which I have to admit it rather difficult. We also began to learn some new skills, such as sculling and whip kick while floating on our backs. I found the whip kick technique to be a rather interesting way to swim that reminds me of a squid.",
    "dates": [
      1548572400000
    ],
    "title": "Swimming",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "As a team, we had worked our way to Semifinals. In between the last round and this one I have improved the scripts further to make them more reliable. This round had four images instead of the usual three, which made it such that teamwork was necessary to achieve a good score. As a team we decided that initially we would divide and conquer the individual images, I did Windows 8.1 as it was the team member who was strongest at Windows. Through the work and dedication we put in we achieved a score of 39 on Debian, 50 points on Windows Server 2016, 69 points on Ubuntu, and 92 points on Windows 8.1. We achieved second in Canada and thus we were so happy to have been guaranteed a spot in CyberTitan, the Canadian national cybersecurity competition!<br><br><img src=\"images/image30.png\"/>",
    "dates": [
      1549177200000
    ],
    "title": "CyberPatriots Semifinals",
    "hours": 7,
    "outcomes": [
      1,
      2,
      4,
      5
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "This was the first week of the Junior Achievement company program. I joined the tech company pilot program because technology has always interested me and because I wanted a first hand experience at working together with other high school students to start a company. It was an invigorating experience to meet so many people who were just as passionate as I was, and I knew great things were to come from our company. This meeting started with a few ice breakers so that we could begin to do some team bonding and we also thought up a list of team norms to establish a foundation for our future collaboration. After this, we began to brain storm some ideas as a team for a tech related product. As well as we created a Slack to maintain communication as a team. We separated out the best ideas and divided them up to be individually researched.<br><br><img src=\"images/image47.jpg\"/>",
    "dates": [
      1549350000000
    ],
    "title": "Junior Achievement Meeting",
    "hours": 3,
    "outcomes": [
      1,
      3,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "Unfortunately, I missed one week of swimming lessons because of CyberPatriots Semifinals, however I worked harder than ever before this week and I was able to catch up to the rest of the class. This week we worked on improving our techniques for the new skills we learned in the previous weeks: sculling and whip kick further. I felt a noticeable improvement in my speed and technique.",
    "dates": [
      1549782000000
    ],
    "title": "Swimming",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "For the second week we went over all of our individual research and narrowed it down to three ideas: an app for grocery stores, a WiFi mesh network app, and a pricing discount card for local businesses. We decided to conduct more research on these three ideas before finally deciding on the our tech related product to submit.<br><br>On the third week of the company program, we decided on a grocery store pricing app using barcode scanning to crowdsource data for our product related to technology. We submitted our idea to Junior Achievement for approval. Afterwards, instead of having elections, we came to a consensus as to who would have each position in the company. We also bought shares into our own company. I got the position of chief technology officer (CTO) as I had the most experience with coding, and I would be leading app development. We started to research app basics, brainstorm company names, as well as potential contacts that could give us advice. From a technical perspective, we start investigate any programming languages, frameworks, APIs, and or platforms now, so that we could start learning how to code next meeting to keep ourselves on schedule. In particular, as the CTO, I looked into exactly what is an app and how are we supposed to having a functional one.",
    "dates": [
      1549954800000,
      1550559600000
    ],
    "title": "Junior Achievement Meetings",
    "hours": 6,
    "outcomes": [
      1,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "At last, the concluding event of a sweet mentorship had come. We went up to the auditorium together and thanked each other, I let him know if he needed anything I would still be glad to help. The SET team gave us a mentorship certificate displayed above, and invited us to join SET as a leader or mentor, an interesting opportunity. It was such an honour to be mentoring my mentee.<br><br><img src=\"images/image3.png\"/><img src=\"images/image8.jpg\"/><img src=\"images/image27.jpg\"/><img src=\"images/image26.jpg\"/>",
    "dates": [
      1550214000000
    ],
    "title": "SET Mentorship Celebration",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4,
      6,
      7
    ],
    "type": "service",
    "experience": "Student Engagement Team Mentorship"
  },
  {
    "content": "For these two weeks of swimming we worked on our distance swim. We worked on our front crawl and back crawl. An area of improvement I had was that I needed to keep my toes on the surface when I do the back crawl to swim more effectively. We continued to work on treading water, sculling, whip kick, and we also learned and improved our dives.",
    "dates": [
      1550991600000,
      1551596400000
    ],
    "title": "Swimming",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "Our tech product idea was approved by Junior Achievement! We looked into the different programming languages that we can use for our app. We discussed programming for iOS and Android separately and also creating a cross platform app. We decided upon using <a href=\"https://dart.dev/\">Dart</a> and <a href=\"https://flutter.dev/\">Flutter</a> to build our app because despite being a new programming language for everyone, as a small team it would be ideal if we could all work on the same code and end up with apps for both iOS and Android. We made a plan that everyone would download Flutter and watch some tutorials so that we're ready to begin coding for the next meeting. In the mean time, we worked on a rough draft of a wire frame today to get an idea of how we would layout the app, which was an interesting skill to learn.<br><br><embed src=\"/embeds/Wire Frame (Rough Draft).pdf\" style=\"width: 100%; height: 770px\" type=\"application/pdf\"><br><br>For the fifth week of Junior Achievement, we worked on our lean business plan and we created our mission statement. \"To support consumers in saving money by creating a crowdsourced community platform.\"<br><br><embed src=\"/embeds/BarGain Lean Business Plan.pdf\" style=\"width: 100%; height: 770px\" type=\"application/pdf\"><br><br>Also, two guest speakers came to share their technology knowledge. The advice they gave was really helpful and they did mention that it would be really difficult for us to be able to finish coding in the 18 weeks provided to us by Junior Achievement. This led us to create more reasonable goals such as completing prototypes prior to major events. Finally, we also took a company photo today.<br><br><img src=\"images/image48.jpg\"><br><br>This was a really busy week, but on the technology side we also started to learn Github which allows us to collaborate on coding, it permits us to code separate parts of the app on each device and sync up our changes.",
    "dates": [
      1551164400000,
      1551769200000
    ],
    "title": "Junior Achievement Meetings",
    "hours": 6,
    "outcomes": [
      1,
      2,
      3,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "This week we did a lot of swimming. I felt a substantial improvement in my standing dive, and I was able to do it much better than before. For the next week, we continued to refine our swimming. We also went to the deep end and learned what to do if we were in a situation where a group of people are stuck in cold water with life jackets. We put the smallest person in the middle and huddle for warmth. What an interesting and useful skill to learn.",
    "dates": [
      1552201200000,
      1552802400000
    ],
    "title": "Swimming",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "For the sixth week of Junior Achievement, we started off by working on the banner. Then we made some plans for the app, such as who would code what. Finally, we started some app development. For the seventh week of JA, we finished our commercial, which can be seen here:<br><br><iframe style=\"width: 100%; height: 320px\" src=\"https://www.youtube.com/embed/7UHMQeTFq8Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><br><br>We also worked more on the app, learning a lot about Flutter and Dart, as well as Android Studio, the integrated development environment we were going to use to code the app.",
    "dates": [
      1552370400000,
      1552975200000
    ],
    "title": "Junior Achievement Meetings",
    "hours": 6,
    "outcomes": [
      2,
      3,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "Following mentorship, I applied for and was accepted as a student engagement team (SET) leader. Today, I met the others on the team. We played a few ice breakers and had a potluck. Following this we learned about our roles as SET leaders and the necessity of goof team work. Our role is to facilitate communication between mentors and mentees and the SET Council, as well as help plan and contribute to the many events that the SET Council hosts.",
    "dates": [
      1552629600000
    ],
    "title": "SET Kickoff Meeting",
    "hours": 3,
    "outcomes": [
      3,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "Today was the last lesson for Swim Kids 5, and we had a fun day once again. At the end of the class, we received our report cards, and I am glad to say that I passed. This time it was more difficult than the previous lesson, but I am happy that through hard work and dedication I was able to persist and overcome the challenges.<br><br><img src=\"images/image18.jpg\"/><img src=\"images/image2.png\"/><img src=\"images/image16.jpg\"/>",
    "dates": [
      1553407200000
    ],
    "title": "Swimming",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "For the eighth week of the company program, we worked on creating suitable banner and business card designs to be used at future trade shows. We also worked more on the app prototype.<br><br>Banner: <img src=\"images/image41.png\"/><br><br>Business card: <img src=\"images/image42.png\"/><br><br>For the ninth week, we started off by with some planning for the WEM Trade Show. We decided that our app prototype was not complete enough to show the public. However, we decided that we should conduct market research to understand the preferences our users would have and whether they would like any features. Through this I learned a lot about how business conduct market research.",
    "dates": [
      1554184800000
    ],
    "title": "Junior Achievement Meeting",
    "hours": 3,
    "outcomes": [
      2,
      3,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "In order to prepare for the Student Engagement Team's Mentorship Training, where each SET leader had to help present, we practiced the mentorship presentation to our peers and advisors. I received and gave out constructive feedback to the other leaders. I think it was very beneficial to receive peer feedback. An area of growth for me that we identified was that I needed to present more enthusiastically to engage the audience.",
    "dates": [
      1554184800000
    ],
    "title": "SET Practice Mentorship Training Presentation",
    "hours": 2,
    "outcomes": [
      1,
      3,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "Today was finally the Junior Achievement's WEM trade show that we had been preparing for for the past few weeks. Another company member and I had the first shift of the day, so we set up and decorated the table. I noted that having shifts was the most efficient way to distribute work among our group for this event.<br><br><img src=\"images/image50.jpg\"/><br><br>Afterwards, we conducted market research with people walking around in the mall. I got to experience communicating with strangers. We got valuable feedback for the app. Generally, people were pretty interested in our app, and I was able to get many people to put their email onto a mailing list to notify them when we release the app. The results of the market research are shown below:<br><br><img src=\"images/image45.png\"/>",
    "dates": [
      1554530400000
    ],
    "title": "Junior Achievement WEM Trade Show",
    "hours": 2,
    "outcomes": [
      1,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "This was the first and second lesson for Swim Kids 6. For these two weeks, we mostly reviewed swimming from Swim Kids 5, it was fairly easy, and I am glad that Swim Kids 5 prepared me well. Furthermore, I have come to appreciate how activity like swimming is a great stress reliever from my academics and extracurriculars.",
    "dates": [
      1554616800000,
      1555221600000
    ],
    "title": "Swimming",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "We have made it to week nine and we are officially halfway done the company program. We made some company member bios to post on social media for the marketing team. Today, we mostly focused on working on the app, at this point we had a working barcode scanner. Two other members were assigned to work on a search feature, and another two members were assigned to work on a shopping list. I roamed around and helped everyone whenever they ran into problems.<br><br>For week ten, we planned out how our company would be represented at Junior Achievement's Alberta Business Hall of Fame, a prestigious event where company members would interact with leaders of the business sector and once again we planned to conduct more market research. More app production occurred, where we finished the shopping list feature and continued to refine the search feature. I personally made the app write to a cloud database, which was nice skill to learn.",
    "dates": [
      1554789600000,
      1555394400000
    ],
    "title": "Junior Achievement Meetings",
    "hours": 6,
    "outcomes": [
      2,
      3,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "Today the other SET leaders and I gave a presentation to the mentors, explaining the benefits of mentorship as well as the roles of a mentor. I also helped out with the tour. At the end, our advisor noted that I was not energetic enough when I was presenting, and did not engage the audience enough. Thus, I noted that this was an area where I could grow in the future.",
    "dates": [
      1554789600000
    ],
    "title": "SET Mentorship Training",
    "hours": 2,
    "outcomes": [
      1,
      4,
      5,
      7
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "This was my first meeting with the grade twelve 2019 grad council. I was recently elected to be the 2020 Grad Council treasurer, and thus the other executives and I would attend this year's grad council meetings to learn more about how the grad council functions to prepare me for next year. Today, we discussed class polls regarding a bonding event, gradwear, and getting the class to fill out a banquet form. We also looked into balloon designs for banquet and commencement. Furthermore, we started planning OSA's Got Talent (OGT) and we voted to decide on the performances. Then, we also discussed the May bonding event. Overall, I found it interesting to see how the grad council works and where it could be improved for next year.",
    "dates": [
      1555048800000
    ],
    "title": "Grad Council 2019 Meeting",
    "hours": 2,
    "outcomes": [
      1,
      3,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "As a member of the Student Engagement Team, I was assigned with selling spirit wear. Throughout the evening, I saw an improvement in my communication skills. At the beginning and in between sessions, there was some time where no one was at the spirit wear table. When I was free, I went and helped the other SET leaders, I noticed how helpful this was and that effective and adaptable cooperation is very important when handling large events. I also learned some new crowd control skills that helped me organize and help the large number of people who walked by. Overall, it was a very rewarding experience to be able to contribute to welcoming the future grade tens to our school.<br><br><img src=\"images/image40.jpg\"",
    "dates": [
      1555308000000
    ],
    "title": "Grade 10 Course Selection",
    "hours": 4,
    "outcomes": [
      2,
      4,
      5,
      7
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "Today, we had a quick meeting to discuss our trip to Ottawa for the CyberTitan competition. We made some plans and also discussed how we would prepare ourselves for the competition. Afterwards, we took a team photo: <img src=\"images/image22.png\" title=\"\"/>",
    "dates": [
      1555480800000
    ],
    "title": "CyberTitan Preparations",
    "hours": 1,
    "outcomes": [
      3,
      5
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "Today we had a small meeting at lunch with just the grade eleven grad executives so we could plan some activities for the bonding event so that the grade twelves on grad council could be surprised too. We worked together to think of some preliminary game ideas for the bonding event. These include: human tic-tac-toe, a potato sack run, human bowling, eating candy hanging on a string while dizzy, and a memory relay circuit. This was a great start to my CAS project!",
    "dates": [
      1555480800000
    ],
    "title": "Grad 2019 May Bonding Event Planning",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "project",
    "experience": "Graduation Council"
  },
  {
    "content": "For the twelfth week of the company program, we first discussed our company's plans for Junior Achievement's Alberta Business Hall of Fame, where our company would have the opportunity to introduce our company to successful entrepreneurs and the public. Then, we looked into improving our website by adding individual bios. Then we worked on the website. As the Chief Technology Officer (CTO) I helped everyone with their parts, and we continued to work on the complicated search functionality, refined the input page, and attempted to implement Sign in with Google to the app. It was great to see our team working together to put the app together.<br><br>In the thirteenth week, we further discussed our plans for ABHOF, and also worked hard on app production. We were able to make the search feature read from the database, as well we make some major strides towards completing data input. We made some plans and assigned more app production work to be able to finish a sufficient prototype for ABHOF.",
    "dates": [
      1555999200000,
      1556604000000
    ],
    "title": "Junior Achievement Meetings",
    "hours": 6,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "Today in preparation for OSA's Got Talent (OGT), a grade twelve grad room representative and I sold OGT tickets to the audience. It was good that there were two of us to make sure we sold tickets right, we also duplicated We also encouraged the performers to refer their friends to come watch, which was an effective way to get more tickets. Afterwards, I put back the table we used.",
    "dates": [
      1556172000000
    ],
    "title": "OGT Ticket Selling",
    "hours": 1,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today, we planned for OSA's Got Talent. The grade eleven executives and I were assigned to setting up before and during performances. Then, we discussed senior theme week, themes and how we were going to communicate them to the class through photo examples. Afterwards, we did some general bonding event planning, such as having a banner, how teams will be made, a tug-of-war, an optional water fight, and a timeline. We discussed balloons again for banquet, and also commencement performers. We were also notified that we would be compiling gradwear orders for them, distributing grad gowns, and also putting diplomas in covers later on. At the end of the meeting, the 2019 grad executives trained us 2020 grad executives one on one. I was glad to have been given experience and personal tips by the current treasurer, as it will help me succeed in my role. I learned that I have quite the difficult job ahead of me, considering I have to keep and share accurate records and ensure that grad council will be financially responsible and successful. I also learned of the many details of my responsibilities like Fundscrip and financial reports to be shared with the class.",
    "dates": [
      1556258400000
    ],
    "title": "Grad Council 2019 Meeting",
    "hours": 2,
    "outcomes": [
      1,
      2,
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today the grade eleven grad executives and I had a voice call where we created a Google Form to ask our class about banquet locations and to submit some logos for gradwear. We came up with logo rules, how we would select a design, and a preliminary timeline for gradwear. We also realized that our grad will coincide with the physics diploma, so we decided to ask the admin to change the dates of banquet and commencement. We made a plan as to when we would announce, process, order, and distribute Fundscrip so that we could start fundraising early. Overall, we made great progress towards kick starting our grad today.",
    "dates": [
      1556344800000
    ],
    "title": "Grad 2019 May Bonding Event Planning",
    "hours": 3,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today, we started off with some distance swimming. This time we had to swim one and a half times further than Swim Kids 5, however the difficulty increase felt much larger. However, through with some practice, I noticed that I was able to successfully swim the distance. Afterwards, we focused on improving our dives. In contrast to swimming, I had a lot more difficulty with improving my standing dives, and I tended to flop into the water instead of gracefully entering it. I noted that this would be an area of improvement for later.",
    "dates": [
      1556431200000
    ],
    "title": "Swimming",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "We had another lunch meeting today to discuss our plans for the bonding event. We also started thinking about a tug of war, where we were going to do a mud pit, however, there was strong objection raised to the idea, so we did not do it. We also had to find more grade elevenths to help us in running the event. Overall, this laid the ground work for the specifics which we will be planning soon.",
    "dates": [
      1556690400000
    ],
    "title": "Grad 2019 May Bonding Event Planning",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "project",
    "experience": "Graduation Council"
  },
  {
    "content": "Together with the other 2020 grad executives we helped with placing and removing stage equipment from the stage while the talent show was ongoing. Overall,the talent show went really well and it was great to see our hard work come to fruition. One notable strategy we used was communicating by voice call with the other side of the stage. This allowed us to be far more organized and communicate with each other clearly. Some improvements for next year would include making a Google form for stage equipment requests,and listing microphones and their stands as two different items to reduce confusion. Another improvement would be to communicate clearly to the performers to have a one way flow where they would enter the stage from one direction and exit out the other. As well as have them watch performances from the sides of the stage instead of the curtain. Thus would allow us to set up far lore easily. OGT was a really great experience and I look forward to planning it again with next year's council.<br><br><img src=\"images/image123.jpg\"><img src=\"images/image44.jpg\">",
    "dates": [
      1556776800000
    ],
    "title": "OSA's Got Talent",
    "hours": 3,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "We started the day off by reflecting on grade 10 course selection. We identified both successes and issues that will be addressed for future events. Then, we began to plan Toolkit for Success, a very important event for SET, as it is one of the events where we prepare the future grade tens for high school life. We also took a team photo.<br><br><img src=\"images/image37.jpg\"></div><br><br>After this, we had a fun team bonding activity. We had a cook off where we had three teams, and each team had a budget of only 16 dollars to go buy ingredients with. Each team was assigned an appliance to cook with: the stove, the oven, and my team had to cook with a microwave. Despite this, with much teamwork and effort, we were able to be creative enough to use the microwave to boil water to make some excellent mac and cheese, as well as using a drinking fountain to wash vegetables to make a salad.<br><br><img src=\"images/image43.jpg\">",
    "dates": [
      1556949600000
    ],
    "title": "SET Retreat",
    "hours": 5,
    "outcomes": [
      3,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "We continued to gradually improve our swimming abilities, refining our strokes to become more efficient. I in particular focused on my whip kick on my back. I learned how to kick much more efficiently, which allowed me to swim faster and further than before.",
    "dates": [
      1557036000000
    ],
    "title": "Swimming",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "Today we had a meeting as a CyberTitan team to discuss our trip logistics. For example, we coordinated when we would meet at the airport, and whether we would bring laptops. We also made plans as to what programs we would put into a Google drive folder to take with us to help us in the competition. This planning was essential to ensuring that our trip and the competition would go smoothly.",
    "dates": [
      1557122400000
    ],
    "title": "CyberTitan Meeting",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "I helped to collect gradwear forms and counted the money for the 2019 Grad Council. From this experience, I learned more about the process for gradwear orders and look forward to applying this knowledge next year for my class.",
    "dates": [
      1557122400000,
      1557208800000
    ],
    "title": "Gradwear Order Collection",
    "hours": 1,
    "outcomes": [
      2,
      4
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "This was a lunch meeting, where the council talked to students interested in designing a logo for our grad council. We also helped to counted money for the 2019 grad council's gradwear orders, and then put them into a spreadsheet since the grade twelves were busy with IB exams.",
    "dates": [
      1557381600000
    ],
    "title": "Gradwear Meeting",
    "hours": 1,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "This meeting was just for the 2020 grad executives given that it was IB exam time for the grade twelves. We went over Fundscrip for next year and learned the process, made some plans for the first grad related assembly for our class, we looked into banquet venues, then we made some more plans for the bonding event: brainstorming some ideas for games and also figuring out food. On the game side, we decided to go with the jenga, relay, trivia bowling, and a target game. We started to think of the rules that each game would have. It was a very productive meeting and we got a lot done.",
    "dates": [
      1557468000000
    ],
    "title": "Grad Council 2019 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "project",
    "experience": "Graduation Council"
  },
  {
    "content": "Two days ago, the CyberTitan team and I traveled to Ottawa, the capital of Canada. Today, was finally the national CyberTitan cyber security competition. We competed in a nine hour competition that was based on a cruise ship disaster simulation. Teams were judged on two components: digital forensics response and vulnerability management. We submitted a large number of tickets that reported the problems we found and how we resolved them. The competition was very intense, given that we were short one member for the first hour due to IB Exams. We also had a little bit of a problem with the net route command, and we missed a piece of paper with important information for a while. If I were to do this again, we would make sure we had all of our information in one place before starting. However, with great team work, once everyone came back we worked non-stop for the remaining eight hours, continually securing the systems, and even eating lunch while working. The CyberTitan competition also provided deep insight into careers in cybersecurity, as well as the importance of protecting people from a global issue: cyber security threats. Personally, this experience resulted in a lot of growth in practical and technical, and cybersecurity skills, as well as communication and teamwork skills. I am so happy to be able to compete, and regardless of the results it was an enlightening experience.<br><br><img src=\"images/image56.jpg\"><img src=\"images/image57.jpg\">",
    "dates": [
      1557813600000
    ],
    "title": "CyberTitan National Finals Competition",
    "hours": 9,
    "outcomes": [
      1,
      2,
      4,
      5,
      6,
      7
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "Today, we went to the headquarters of two cyber security companies based in Ottawa: <a href=\"https://2keys.ca/\">2Keys</a> and <a href=\"https://pythian.com/\">Pythian</a>/<a href=\"https://tehama.io/\">Tehama.io</a>. We learned a lot about cyber security careers through talking with experts from the cyber security field. The amount of demand for cyber security specialists was unexpectedly large. We talked a bit about the ethics of cyber security as well as the international relevance that cyber security has and how cyber attacks are a global issue.<br><br>We also went to the Parliament of Canada, where we met two Members of Parliament. It was interesting to see the importance that is place on the future of cybersecurity.<br><br><img src=\"images/image55.jpg\">",
    "dates": [
      1557900000000
    ],
    "title": "CyberTitan Planned Activities",
    "hours": 6,
    "outcomes": [
      4,
      6,
      7
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "To finish off the CyberTitan national competition, we had an awards gala presented to us by the Information and Communications Technology Council of Canada. We were given an opportunity to network with our fellow competitors and industry professionals. There was an interesting keynote address from Brigadier-General Andrew Jayne, Director General Cyberspace of Canada. We got fourth place in Canada with 1181 points, only about 40 points away from third. I am so proud of the teamwork we put in and overall CyberTitan was an amazing experience. I look forward to doing CyberTitan again next year, and hopefully we can build upon our successes and mistakes next year.<br><br><img src=\"images/image51.jpg\"><img src=\"images/image54.jpg\"><img src=\"images/image52.jpg\"><img src=\"images/image53.jpg\"><img src=\"images/image63.jpg\"><img src=\"images/image70.jpg\"><img src=\"images/image69.jpg\">",
    "dates": [
      1557900000000
    ],
    "title": "CyberTitan Awards Gala",
    "hours": 5,
    "outcomes": [
      2,
      4,
      5
    ],
    "type": "creativity",
    "experience": "CyberPatriots"
  },
  {
    "content": "In this meeting, the grade twelves have finally returned after taking their IB exams. We discussed plans for Spring Carnival, as grad council would be responsible for food distribution, senior theme week, banquet ticket pricing, and the grad gift to the school. Of course, this meeting contained more bonding event planning. We decided with the grade twelves that we should let the students know that they can bring water guns, since the grade twelves planned some wet activities, that go after our bonding event games, we made some plans for a banner that students would get to write on, and we also worked out how the pizza order form would work. Overall, it was a very productive meeting that prepared us for the weeks to come.",
    "dates": [
      1558677600000
    ],
    "title": "Grad Council 2019 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "project",
    "experience": "Graduation Council"
  },
  {
    "content": "Today we went to the commencement venue and we worked together to film a video tutorial that showed the path the grade twelve graduands would have to take to walk the stage to receive their diploma. I was as an actor in walk the stage video. I also helped to film one scene and learned how to use a fancy camera. It was interesting to me that in a bit more than a year I too will be walking across the stage.",
    "dates": [
      1558764000000
    ],
    "title": "Grad How To Walk The Stage Video",
    "hours": 2,
    "outcomes": [
      1,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today as a company to contribute back to the community we went outside and picked up the garbage that was littering downtown Edmonton. It feels good to be able to directly contribute to the betterment of the environment and the community.<br><br><img src=\"images/image46.jpg\"/><br><br>Afterwards, we finished our company’s finances, I was glad to be able to contribute my previous knowledge in this area. Finally, as a company we worked collaboratively to finish the Shareholders' Report, in the process learning how real businesses would write Shareholder's Reports.<br><br><embed src=\"/embeds/BarGain_Shareholder's_Report.pdf\" style=\"width: 100%; height: 770px\" type=\"application/pdf\">",
    "dates": [
      1559023200000
    ],
    "title": "Junior Achievement Meeting",
    "hours": 3,
    "outcomes": [
      2,
      4,
      5,
      6
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "Today, was the last grad 2019 may bonding event voice call between us grade eleven executives. We did a bit more planning and created an action plan. To ensure the action is carried out we assigned roles to each member. I was assigned with making the trivia bowling game's questions, and also working on a bit of a script as my partner and I would be hosting the game. We also worked out a specific timeline for the activities in the bonding event as well. We had to make sure that we would have enough time to play each bonding game. We decided that the water gun target game, would be a filler activity, only to be used if we have extra time. At last, this voice call meeting allowed us to get everything into order before the big event.",
    "dates": [
      1559023200000
    ],
    "title": "Grad 2019 May Bonding Event Planning",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "project",
    "experience": "Graduation Council"
  },
  {
    "content": "The bonding event has finally happened. It went really well and it looked like the grade twelves had a great time. Due to severe air quality issues, we had to move the event indoors and all of the outdoor events were unavailable. This led to many last minute changes, but it worked out. In the future, we should always have an indoor plan from the beginning. I helped in particular with the trivia bowling event, where I worked with another executive to ask the questions over a microphone. After all the questions were asked, we let them record their answers on whiteboards. Then, the highest scoring got the most chances to go bowling. The team that knocked over the most pins would win. It was very hard to aim bowling balls, which was very funny. However, what we should have done is let fourth place go first. This would allow for first place with the most number of tries, to not waste so many attempts. For the Jenga game, we had a few quick last minute plan switches, but it also went really well. The relay had to be changed the most, and we removed the running, and we did not have water to be chugged. We thought it would be the most exciting event, but it was less exciting than we thought it would be. However, it was still quite fun for the grade twelves. We had some ice cream prizes for the grade twelves, who were very competitive, this was definitely a nice touch. After the event, we had a quick mini meeting to reflect on how we did and brainstorm any changes we would want to make for next year. Next year, we intend to rename these bonding events \"Class Wars\" to make them sound more exciting. Honestly, this CAS Project has been a very fun experience for me, and I can't wait to plan more events for my grade next year.<br><br><img src=\"images/image58.jpg\"><img src=\"images/image59.jpg\"><img src=\"images/image60.jpg\">",
    "dates": [
      1559196000000
    ],
    "title": "Grad 2019 May Bonding Event",
    "hours": 3,
    "outcomes": [
      2,
      3,
      4,
      5
    ],
    "type": "project",
    "experience": "Graduation Council"
  },
  {
    "content": "Spring Carnival is an annual event held at my school to give back to the community. As a school, we invite students from two local elementary schools and another school that where many of the children are in less fortunate circumstances to be paired with high school students to enjoy a carnival at our high school. I was really excited and signed up with a buddy to be paired with a student from an elementary school. However, it was revealed to me that grad council was responsible for food distribution, but I was still glad to be able to take part in creating this fun day for the younger students. My first role was setting up the food distribution tables, resupplying the tables, and helping out with the condiments. I can now say with confidence that I can squeeze ketchup out of the bottle for the little kids. After food distribution slowed down and we closed one line of tables, I went and helped out with the cotton candy machine. There was cotton candy flying everywhere, and one grad council member even had a mask and goggles to prevent cotton candy from flying in his face. Overall, the experience was a welcome break from the stress of school and extremely rewarding to be able to contribute back to the community.",
    "dates": [
      1559282400000
    ],
    "title": "Spring Carnival",
    "hours": 4,
    "outcomes": [
      1,
      4,
      5,
      6
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today as an executive of the 2020 Grad Council, I helped out with deflating and putting away the bowling pins we used for our bonding event, as well as placing diplomas and class photos into the diploma covers then labeling them with the names of the graduands. We decided that the most effective way to do this was by working in an assembly line fashion, and because of our team work we were able to finish it within a reasonable time frame.",
    "dates": [
      1559282400000
    ],
    "title": "Grad 2019 Bowling Pins & Diploma Preparations",
    "hours": 2,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today I recognized that I had difficulty with standing dives and realized that it was an area for growth. With more practice however, I was able to improve much more and do them more fluidly without hitting the water like a rock. In the second class, I finally starting to work out problems with my sculling and began to do be able to do it much more effectively, after much trial and error.",
    "dates": [
      1559455200000,
      1560060000000
    ],
    "title": "Swimming",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "Today I worked with some of the other grad council executives to process our Fundscrip orders by checking them over and then entering them onto the website. <a href=\"https://www.fundscrip.com/\">Fundscrip</a> is one of the ways in which we will fundraise for our graduation ceremonies next year. From this experience, we learned to improve process, and for next time we will have more computers so that we can have more people working collaboratively to enter data such that we can finish the task faster. This was the first thing related to finance for next year's grad council, and I am excited to be able to start contributing more directly to making next year's graduation a success!",
    "dates": [
      1559541600000
    ],
    "title": "Grad Fundscrip Processing",
    "hours": 1,
    "outcomes": [
      1,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today was the last day of the company program. As a company of high school students, while we did not complete our rather ambitious goal of creating an entire app, given that we only had eighteen weeks, we had achieved so much and successfully created a prototype. We learned a ton about the app development experience, including tools such as Flutter, Dart, Github, and Android Studio. We had 88 commits in our Github repository that chronicle our coding journey.<br><br><img src=\"images/image49.png\"><br><br>This experience has taught me a lot about all the aspects of business and coding, but most importantly it taught me the importance of working together as a team to achieve. ",
    "dates": [
      1559628000000
    ],
    "title": "Junior Achievement Meeting",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "Today was the day where awards would be distributed to the Junior Achievement achievers and companies. It was a delightful surprise when it was announced that our company received the Company of the Year Award, which is awarded to the most outstanding company in this year of the Junior Achievement company program. Overall, it would not have been possible without the perseverance and growth we made as individuals and as a team. From being a team of nine high school students and none of us having had any experience with app development before, to us working collaboratively to create a business plan and developing a successful app prototype, this year of Junior Achievement was a super rewarding experience. <img src=\"images/image35.jpg\">",
    "dates": [
      1559800800000
    ],
    "title": "Junior Achievement Awards",
    "hours": 2,
    "outcomes": [
      2,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "Today was the last Grad Council 2019 Meeting, we helped the grade twelve council choose a quote for commencement. Following this, we worked as a group to write thank you cards to the teachers on behalf of the council. Without collaboration, it would take a really long time for one person to be able to write all of the cards. Overall, I am very thankful to have been given the opportunity to have the great experience of working with and learning from the grade twelve 2019 Grad Council.",
    "dates": [
      1559887200000
    ],
    "title": "Grad Council 2019 Meeting",
    "hours": 2,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "<span>Toolkit for Success is a major event hosted by the Student Engagement Team to give inform and integrate incoming grade tens into high school. I came early and I helped with set up! I helped to put up signs as well as fixed technical problems with the computers. I also gave a presentation about the usefulness of technology and how to use it healthily with another student. While we made the presentation, I realized that the information we put in there was really important as it will have an impact on the technology use of future students. There was a video in our presentation, however due to a miscommunication it wasn't shown, despite this we improvised and still delivered the necessary information. I learned that things don't always go to plan, but as long as we anticipate it we can adapt. For next time, I would check with the executives to make sure the video is added properly into the presentation. <img src=\"images/image36.png\"/> I also helped out with the distribution of food, spirit wear and clean up. What I enjoyed most about this event was spending time meeting the new grade tens, as well as pushing them to be excited for high school through the fun activities the student engagement team planned. It was truly rewarding to see the smiles on their faces and how happy they were to participate.</span>",
    "dates": [
      1559973600000
    ],
    "title": "Toolkit for Success",
    "hours": 5,
    "outcomes": [
      1,
      2,
      5,
      7
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "This was the second last day of swimming lessons, and we did some intense swimming that literally pushed me to my limits. After treading water for a minute and thirty seconds after so much strenuous swimming, I unfortunately threw up. However, I learned that one must be careful when pushing their limits and that an area of growth would be my physical endurance.<br><br>The following week was the last day of swimming and I successfully passed Swim Kids 6! Throughout this experience I have learned so much about swimming while at the same time enjoying physical activity regularly.<br><br><img src=\"images/image23.jpg\"/><img src=\"images/image24.jpg\"/><img src=\"images/image25.jpg\"/>",
    "dates": [
      1560664800000,
      1561269600000
    ],
    "title": "Swimming",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Swimming"
  },
  {
    "content": "This meeting was the last planning meeting with just the grad 2020 executives and one of our grad advisors to ensure that the next week would go smoothly. We received the Fundscrip for our year, so we planned out and announced a distribution date. We also got prepared for gown distribution, banquet, and commencement by dividing roles amongst us. All of this planning was necessary for the following important week to be a success.",
    "dates": [
      1561096800000
    ],
    "title": "Grad Council 2019 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "I distributed the Fundscrip gift cards to the students who ordered them from our graduating class today. While I was waiting, I also worked together with the other executives to set up grad gowns for pickup. Some students couldn’t come today so we had to accommodate, we decided to ask them to come on Wednesday to pick up their fundscrip. Overall, if I were to do this again I would make sure that we could distribute it earlier in the month and not during finals, as it created complications.",
    "dates": [
      1561356000000
    ],
    "title": "Grad 2019 Fundscrip Distribution",
    "hours": 2,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today the 2020 Grad Council and I helped to distribute grad gowns, caps, tassels, IB honor cords, and banquet tickets to the grade twelve graduands. We divided the roles up and I was distributing tickets, and the other executives either helped to distribute gowns, caps, tassels, or helped to confirm that the graduand received everything. It went well, but we did not completely distribute all of the gradwear. As well, one student forgot to sign to confirm that they got their gradwear, but we managed to take care of the situation later. As well, I followed up on the students who could not get their Fundscrip on Monday. Following this we did a little bit of organizing so that all the things would be in one place to bring tomorrow.",
    "dates": [
      1561356000000
    ],
    "title": "Grad 2019 Gown Distribution",
    "hours": 3,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "I met up with some of the other 2020 grad council at the banquet venue, the Edmonton Convention Centre. We worked with the balloon lady to help set up balloons. While transporting them into the banquet hall, I accidentally popped one, luckily we were able to get another one. We moved them all into the banquet hall and it looked great!</span><img src=\"images/image32.jpg\"><img src=\"images/image33.jpg\"><span class=\"c2\">Following this, we placed the flower vases and mason jar centerpieces on the tables.</span><img src=\"images/image34.jpg\"><span>We also helped out a little with the performance rehearsal. Once the banquet was about to start we turned on fairy lights and put them back into the mason jars. It was very beneficial that we were working collaboratively, as without the help of each other, none of us would be able to achieve such a monumental task alone.",
    "dates": [
      1561615200000
    ],
    "title": "Grad 2019 Banquet Preparations",
    "hours": 8,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Wow all of our preparations led to such an outstanding banquet! We welcomed people into the venue, and also signed them in. When the traffic was low, we even led people to their seats. After the presentation, we also helped the guests take the flowers out of the vases. This allowed us to clean up and put away the vases and centerpieces in record time. Overall, it was a great experience and I was glad to see all of the hard work of grad council finally come to fruition.",
    "dates": [
      1561615200000
    ],
    "title": "Grad 2019 Banquet",
    "hours": 5,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "I worked with a few other executives to bring balloons from the banquet venue to the commencement venue. This year we tried an indoor route to avoid the outdoors and the wind. However, it turns out that due to pressure differences between buildings it was just as windy indoors if not more. Luckily we managed to not pop any of the balloons in transport. We also moved the flowers over and placed them on the stage. We added a few balloons to the pillars to fix them up.",
    "dates": [
      1561701600000
    ],
    "title": "Grad 2019 Commencement Preparations",
    "hours": 3,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "During commencement I was an usher for the graduands. We seated the graduands down and also made sure that guests did not sit in areas restricted to students. We also led the graduands towards the stairs so that they could walk the stage, and then we reseated them. We kept things going smoothly, I found it quite an experience to watch the commencement of the class of 2019, as in only a year we will also be walking across the stage like them. After it was finally finished, we led the graduands out of the theatre. Unfortunately, our nice lines of graduates became a blob on the way upstairs, however it worked out as we slowed them down at the top of the stairs. After, the grad cap toss, I helped to distribute gradwear. However, it was very difficult for one person to both find people and hand out gradwear, and thus some graduates were not able to get their gradwear, and other arrangements had to be made. Finally, after all was done, we helped the balloon lady pop the balloons.<img src=\"images/image31.jpg\">",
    "dates": [
      1561701600000
    ],
    "title": "Grad 2019 Commencement",
    "hours": 4,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "<span>Today, we had a short meeting discussing our next steps as a company. Because we won the Company of the Year Award, our company was allowed to send three representatives to compete at Junior Achievement Canada’s Youth Success Summit. Through discussion with each other, we decided to collaboratively improve the prototype a bit further, work on getting the app onto an iOS device, and make it available for download on Android. Since this was likely the last time we would see our advisors, we also gave them thank you cards. After the meeting, I added more data to the database, I learned how to build an APK file that people would install onto their devices to use our app. This taught me how to create an APK file that can install Android apps, something that I was curious about for the longest time. &nbsp;I also coded the website where you can download a prototype of our app for Android: </span><span class=\"c13\"><a class=\"c15\" href=\"https://bargain-ja.web.app\" target=\"_blank\">https://bargain-ja.web.app/</a></span><span>&nbsp;</span><br><br><img src=\"images/image61.jpg\"/><img src=\"images/image62.jpg\"/>",
    "dates": [
      1562133600000
    ],
    "title": "Junior Achievement Meeting",
    "hours": 2,
    "outcomes": [
      1,
      3,
      4,
      5
    ],
    "type": "creativity",
    "experience": "Junior Achievement"
  },
  {
    "content": "To have some activity over the summer, I decided to walked and biked around my neighboorhood while playing some Pokémon Go. This week I travelled a total of 27.6 km and 42562 steps. As an area of imporvement, I look forward to attempting to surpass this in the following week as I continue to play Pokémon Go. <br><br><img src=\"images/image64a.png\"/>",
    "dates": [
      1563170400000,
      1563256800000,
      1563516000000,
      1563602400000,
      1563688800000
    ],
    "title": "Pokémon Go",
    "hours": 9,
    "outcomes": [
      2,
      4
    ],
    "type": "activity",
    "experience": "Pokémon Go"
  },
  {
    "content": "I recently went to a grand opening of a Korean supermarket in my town. I noticed the very interesting alphabet the Korean language uses: Hangul. While I already knew how to read in Chinese and English, I identified Korean as an area of growth. As a result, I decided to learn the Korean alphabet with Duolingo. </span> I used screen recording software to record my sessions, and uploaded them to this Youtube playlist, so feel free to look through it to view my progress:<br><br><iframe style=\"width: 100%; height: 320px\" src=\"https://www.youtube.com/embed/videoseries?list=PLBaRf-OdOaJ4tCRz0gfy48S4GMs8IetGm\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe><br><br>Unfortunately, I lost my 44 day streak because I did not use my computer for a day. This motivated me to keep going until I have learned Korean for 100 days. Throughout this month and a half, I was able to gain an in depth understanding of the Korean alphabet, in the next few months I should look into improving my knowldege surrounding basic phrases, verbs, and adjectives.",
    "dates": [
      1563170400000,
      1563256800000,
      1563343200000,
      1563429600000,
      1563516000000,
      1563602400000,
      1563688800000,
      1563775200000,
      1563861600000,
      1563948000000,
      1564034400000,
      1564120800000,
      1564207200000,
      1564293600000,
      1564380000000,
      1564466400000,
      1564552800000,
      1564639200000,
      1564725600000,
      1564812000000,
      1564898400000,
      1564984800000,
      1565071200000,
      1565157600000,
      1565244000000,
      1565330400000,
      1565416800000,
      1565503200000,
      1565589600000,
      1565676000000,
      1565762400000,
      1565848800000,
      1565935200000,
      1566021600000,
      1566108000000,
      1566194400000,
      1566280800000,
      1566367200000,
      1566453600000,
      1566540000000,
      1566626400000,
      1566712800000,
      1566799200000,
      1566885600000,
      1566972000000,
      1567058400000,
      1567144800000
    ],
    "title": "Duolingo Korean",
    "hours": 3,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "creativity",
    "experience": "Duolingo Korean"
  },
  {
    "content": "This wekk I improved substantially, walking and biking 34.4 km and approximately 53545, for a total of around 62 km and 96107 steps over eight days while I played Pokémon Go. I realized that gamification was a fairly good motivator for exercise. In the second week, I managed to improve my distance, travelling an extra 6.8 km compared to last week. Overall, it was a rewarding experience to get some exercise and have some fun exploring my neighborhood while I was at it.<br><br><img src=\"images/image64b.png\"/>",
    "dates": [
      1563861600000,
      1563948000000,
      1564120800000,
      1564207200000,
      1564293600000
    ],
    "title": "Pokémon Go",
    "hours": 9,
    "outcomes": [
      2,
      4
    ],
    "type": "activity",
    "experience": "Pokémon Go"
  },
  {
    "content": "Today we had a meeting during our summer vacation to come up with plans for the entire year up until our graduation. We discussed a variety of topics including: elections, bonding, making a birthday wall, OSA's Got Talent, candygrams, and our bottle drive. One of the many optimizations from last year is that we will have envelopes for each person for candygrams, similar to how compliment cards are done, as this makes distribution far easier. We also worked on plans for our first Class Wars (bonding event) which will be taking place later this month. It's still hard to believe that we will be the ones graduating. Overall, this meeting was a really great start to the year to come.",
    "dates": [
      1565589600000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today, we had a meeting with our advisor during our summer break. We discussed our plans for the entire year as the grad council. We also discussed the class wars event that would be occuring later this month. Our advisor recommended that we find some grade elevens to host the event so we could participate too. We also discussed a timeline for the grad logo. In addition, we also set meeting dates for the year, and got ourselves organized with a Google Calendar. We worked very well as a team, with one person writing the meeting minutes, another updating the year plan document, and I updated the calendar. We even discussed things far in the future, like who we would like to be our commencement speaker. Finally, we also filmed an ad for Class Wars to encourage our classmates to attend our first event as the class of 2020.",
    "dates": [
      1566194400000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "This morning was time for the grade tens to register at my school for the first time. To help them along, the Student Engagement Team organized their registration such that we would pair them up with their mentors and then send them in together. As a group leader, I was in charge of making sure mentors and mentees find each other, as well as taking attendance. Something I would change for next time is to have the attendance sheet line up mentors and mentees properly which would make things easier. Unfortunately, one mentee may have went in and did registration on his own, in the future I would emphasize to the mentee that he should wait for his mentor to come so they can go together. Another mentee didn't show up. However, overall I think grade ten registration was a success and it was helpful to the grade tens.",
    "dates": [
      1566799200000
    ],
    "title": "Grade 10 Registration",
    "hours": 3,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today was the first Class Wars! We started off with a few grad related announcements, then separated into our English classes for some fun bonding activities, that included trivia, bowling, and jenga. I think the grade eleven MCs did a pretty good job, despite a few minor issues due to misunderstandings. Despite scoring only four questions in trivia, my class managed to pull ahead in jenga and got first place. We had too many prizes as we expected more people to show up, so in the end, everyone shared the prizes. There was not as many people as we expected, perhaps this was because it rained. In the future, we need to push harder to advertise our event. For example, we may perhaps only give some special grad swag to people who show up to the next Class Wars. In general, I think the people who came had an amazing time and this event was a great start to creating a stronger community within our class.",
    "dates": [
      1566799200000
    ],
    "title": "Grad 2020 Class Wars",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "For grade ten orientation day, the grad council collaborated with the student's union to help make the barbeque lunch for the incoming grade tens. Today was a busy day, as we helped with: spraying the grill, making the sauce, grilling the patties, and then cleaning the grill afterwards. We also had a short meeting to reflect on yesterday's class wars. In addition, we also handed Fundscrip forms out to the grade tens and elevens, hopefully this will allow us to meet our goals. Overall, today was a great experience, and it felt great to be able to give back to the school community.<br><br><img src=\"images/image122.jpg\">",
    "dates": [
      1566885600000
    ],
    "title": "Grade 10 Orientation Day",
    "hours": 5,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "안녕하세요! For the past few months I continued using screen recording software to record my sessions, and uploaded them to this Youtube playlist, so feel free to look through it to view my progress. I learned some basic verbs, adjectives, and even started demonstratives.<br><br>I had used screen recording software to record my sessions, and uploaded them to this Youtube playlist, so feel free to look through it to view my progress:<br><br><iframe style=\"width: 100%; height: 320px\" src=\"https://www.youtube.com/embed/videoseries?list=PLBaRf-OdOaJ4tCRz0gfy48S4GMs8IetGm\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe><br><br>From knowing absolutely no Korean, over more than hundred days of learning Korean, I think this experience has enlightened me on the language. I look forward to learning more Korean someday in the future!",
    "dates": [
      1567317600000,
      1567404000000,
      1567490400000,
      1567576800000,
      1567663200000,
      1567749600000,
      1567836000000,
      1567922400000,
      1568008800000,
      1568095200000,
      1568181600000,
      1568268000000,
      1568354400000,
      1568440800000,
      1568527200000,
      1568613600000,
      1568700000000,
      1568786400000,
      1568872800000,
      1568959200000,
      1569045600000,
      1569132000000,
      1569218400000,
      1569304800000,
      1569391200000,
      1569477600000,
      1569564000000,
      1569650400000,
      1569736800000,
      1569823200000,
      1569909600000,
      1569996000000,
      1570082400000,
      1570168800000,
      1570255200000,
      1570341600000,
      1570428000000,
      1570514400000,
      1570600800000,
      1570687200000,
      1570773600000,
      1570860000000,
      1570946400000,
      1571032800000,
      1571119200000,
      1571205600000,
      1571292000000,
      1571378400000,
      1571464800000,
      1571551200000,
      1571637600000,
      1571724000000,
      1571810400000,
      1571896800000
    ],
    "title": "Duolingo Korean",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "creativity",
    "experience": "Duolingo Korean"
  },
  {
    "content": "I helped set up for the tea party by placing tables in the auditorium due to poor weather outdoors. We carried containers for the tea upstairs, this demonstrated how important collaboration is to getting things done in a timely manner. As well, I helped to make the iced tea in the cooler. Overall, the event was a success, a large number of mentees and mentors attended, had some tea and time to reflect on their first week of school.<br><br><img src=\"images/image65.jpg\">",
    "dates": [
      1568008800000
    ],
    "title": "SET Tea Party",
    "hours": 1,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "I always knew that activity would be the stand of CAS that would be the most difficult for me. To get more hours for this strand and also get more fit, I signed up for cross country. This was my first time being on a school team of any sort. Prior to the race, we learned some warm up activities and had a quick jog. I ran the rookie race today, and it was a distance of three kilometres. I got a cramp halfway through the beginning of the first lap, but kept pushing on. Near the end I managed to ignore the pain in my stomach and ran faster. I was pretty close to last and was in 143th place. While I did not do well in this race, it does demonstrate that this definitely is an area of growth for me. In order to get back in shape and to do better in future races, I am committing to doing some more running in my free time.<br><br><img src=\"images/image84.png\"/>",
    "dates": [
      1568181600000
    ],
    "title": "Cross Country Rookie Race",
    "hours": 1,
    "outcomes": [
      1,
      2
    ],
    "type": "activity",
    "experience": "Cross Country"
  },
  {
    "content": "This was the first Student Engagement Team (SET) meeting of this school year. We discussed our plans for the next SET event. We also made plans for the Career Fair that SET would be hosting. We were divided into three committees that would focus on one aspect of planning: advertising, outreach, and sponsorship. Through these committees we divided up the work based on our skills. This allowed for more efficient collaboration. Afterwards, we filmed a little video in collaboration with Headstrong, a Mental Health Commission of Canada initiative to be used in one of their events. Overall, it was a very productive and fun meeting!",
    "dates": [
      1568354400000
    ],
    "title": "SET Meeting",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "This was my first practice for cross country. We did some warm ups and then jogged down to the park. Then we did ABC Drills, followed by a run that consisted of two minutes of running, 1 minute of walking, then three minutes of running, then 1 minute of walking. This was repeated three times and by the end I felt tired but well exercised, I was also very thirsty. I learned that it would be very helpful if I brought a water bottle. Walking back up hill was difficult, but I think this practice was worth it.",
    "dates": [
      1568613600000
    ],
    "title": "Cross Country Practice",
    "hours": 2,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Cross Country"
  },
  {
    "content": "Today we had a fun relay race, and personally I did a lot better than in the previous race, and as a team we worked really hard and we got 103rd. My approximate individual time was around 19 minutes, which I believe to be an improvement. Running a relay was a new experience for me, I was the third runner, and I had to run when the runner before me crossed the line. I managed to run the last 400 metres, which exceeded my expectations, and sprinted the last 10 metres down the chute. I immediately dropped to the ground after, but my teammates told me to get back up so I wouldn't pass out. Overall, this race was more difficult than the last as it was hilly, but I managed to overcome the challenge.<br><br><img src=\"images/image85.png\"/>",
    "dates": [
      1568786400000
    ],
    "title": "Cross Country Relay Race",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4,
      5
    ],
    "type": "activity",
    "experience": "Cross Country"
  },
  {
    "content": "Today I woke up extra early, at 5:45 AM in the morning to get to school at 6:10 AM to help out with making pancakes for my school's annual pancake breakfast. Luckily, we had already cleaned the grill and made the batter yesterday, otherwise we would have to come even earlier. We set up the tables and I helped to set up the speakers. We got the grill going and I worked to pour the pancake batter on the grill. Overall, collaboration was essential in all aspects to making this event a success. We had to work together to set up, but also while making pancakes. We had three people flipping pancakes, three people placing batter, two people running the pancakes to the distribution table, and many people distributing the pancakes and topics. Without working together, this event wouldn't be feasible. I was really happy to have been able to help out with the pancake breakfast, which brought happiness to so many students!",
    "dates": [
      1568959200000
    ],
    "title": "Pancake Breakfast",
    "hours": 3,
    "outcomes": [
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "This was our first grad meeting with our new advisors and room representatives. First, we discussed our roles, then we did a quick and clever bonding activity: one where everyone drew a picture, and then we rotated the pictures among us, with people free to add any modifications. This bonding activity served as a good analogy to how grad council functions as a collaborative body. Then, we discussed and planned for the photo booth for the upcoming Friday, as well as food sales, Class Wars, the grad song and quote, and Hauntograms. We asked for the opinions of the room reps on the type of hoodies we would get for grad wear as well. This meeting has allowed us to make sure that everyone will be on the same page so that Grad Council will be able to work to its fullest in the future.",
    "dates": [
      1568959200000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "This SET (Student Engagement Team) Event was a competitive game where mentors and mentees would have to run away from a growing amoeba, as if they were tagged they would have to join the amoeba, the last few pairings alive would get food prizes. I was asked by an executive to help take photos for this event. I think that the event was fun, however, it was a little chaotic, as people were not exactly following the rules, and starting doing mitosis, or otherwise known as separating the chain into multiple chains. In order to end the game faster, we had to shrink the size of the field, however, this still didn't work and we had too many winners and not enough prizes as a result. We came to the conclusion that we should not change the rules in the middle of a game. For next time, we have to be more careful and consider the consequences of people not following the rules.<img src=\"images/image66.jpg\"/>",
    "dates": [
      1569304800000
    ],
    "title": "SET Amoeba Tag Event",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "Today's practice was not bad and I remembered to bring my water bottle this time. We jogged down to the park and after a few ABC drills to warm up we began our main set: a three minute run followed by a one minute walk, then a two minute run, and then a one min walk, we did this set three times for a total of twenty one minutes. Before we started I set a goal to pace myself, as from the last race I found that pacing is important. My goal of maintaining a pace of  one lap per two minutes was achieved and I was even able to lap a few of my friends. Our coach reminded us that attending practices would give us an advantage. We walked back up the hill together, and this time it was much easier compared to the first time.",
    "dates": [
      1569823200000
    ],
    "title": "Cross Country Practice",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Cross Country"
  },
  {
    "content": "We started this grad meeting by asking a room rep to give us a recap of last week's meeting to make sure everyone was on the same page. Today we welcomed the following year's grad presidents to our council, for succession planning, so that they can learn their role by participating in the planning for our grad. Then, we made plans for the upcoming October food sale. One of the room reps brought forward a suggestion from their class to create menus to make people excited for the food sale, we loved that idea so we asked our talented communications officer to design it. We then discussed a class memorial/scholarship. We also had a vote on what swag to give to our class, with the top two being grad branded MUJI pens, and notebooks. We also discussed our plans for the grad song and quote. For the quote the council choose from a list of suggestions submitted by the class. We selected “What you leave behind is not what is engraved in stone monuments, but what is woven into the lives of others.” from Pericles. For the song, our advisor suggested that we could have someone or a group from our class sing it so it would be more special and sentimental. We resolved to put out a form and ask if anyone would be willing to sing the grad song. After this, we looked at and choose designs for Hauntograms. This meeting was super productive, and we are so excited to keep working to make grad a success.",
    "dates": [
      1570168800000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Today was the last practice for cross country. I have been committed to cross country as I had only missed one practice and had attended two races this season. After some quick stretches, we ran downhill to the park for more running. We did some ABC Drills and then proceeded to the main set. Today the main set was a one min run, then a one minute walk, a thirty second run, then another one minute walk, this was repeated five times for twenty minutes. We ran at quite a high intensity as the lengths of the run were quite short. I felt like I had exercised well and was not exhausted, but tired from a good run. Walking back up the hill was easier than ever and I was able to run up for most of it. Afterwards, I asked my coach to sign my CAS forms. Overall, I think this activity was a really way to get fit and also challenge me to improve in an area I am not so good at, running, following this experience, I have noticeably improved, and I intend on doing more activity in the future.<br><br><img src=\"images/image67.jpg\"/><img src=\"images/image68.jpg\"/>",
    "dates": [
      1570428000000
    ],
    "title": "Cross Country Practice",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Cross Country"
  },
  {
    "content": "For this grad meeting, we reflected upon the food sale. We made the record for the profit generated from a food sale. We noted that having some members ensure that people didn't cut the line made the crowd more happy. We quickly went over group norms with our new grade eleven presidents. We then started planning for class wars. We choose to do a table pong game. We spent too much time debating the point system, this slowed down the meeting, and was not efficient. In the future, it is better to have one person explain the specifics, and then go through changes one by one systematically so no one gets confused. We then discussed gradwear, and unfortunately bucket hats were unfeasible. We also talked about pre-banquet venues where people dress fancy and take photos, city hall was unavailable, we voted on using the Citadel instead after going through a list of options. We also discussed the plan for operating Hauntograms.",
    "dates": [
      1571378400000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "We distributed the pizza and then afterwards, we sold the remaining slices. We ended up breaking even on the grade twelves. However, we had to pay for the pizza for the volunteers, but this is reasonable considering how much they are helping us with running the games. Class wars was super successful and everyone sounded like they were having a really good time. The pong game worked well, but it was cut a bit short because the other two games took a bit too long.<br><br>Parent info night also went well except one parent asked us why it seemed like we didn't direct the information towards the parents but towards students, but we managed to sort it out. Another thing we could have improved was starting to projector earlier. To improve attendance, we could perhaps combine this event with another event such as university open house.",
    "dates": [
      1571378400000
    ],
    "title": "Grad Class Wars and Parent Info Night",
    "hours": 3,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "For grade eleven transition day, my group of the student engagement team leaders hosted a table with tips for resumes. I think having an example, was very useful for the grade elevens. Additionally, we gave out resume worksheets if they wanted a place to start.<br><br><img src=\"images/image71.jpg\">",
    "dates": [
      1572328800000
    ],
    "title": "SET Grade 11 Transition Day",
    "hours": 1,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "Hauntograms is another fundraiser for grad, where we sell candygrams to the students. We sorted the Hauntograms, but it took longer than we would have liked. One problem was that the envelopes were difficult to fold, because the cards were slightly too long. In the future we will probably print four cards per page to address this and save paper. The delivery of the cards themselves were very effective, but we found out that it was unnecessary to split up into two groups.",
    "dates": [
      1572415200000,
      1572501600000
    ],
    "title": "Grad Hauntograms",
    "hours": 1,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "For this grad meeting, we started off with a reflection on the class wars event, and Hauntograms. We are considering doing an extra class war because of the success of the last one. For the next food sale, we will ask if parents from other class will still want to cook as suggested by a parent. Then, we started talking about bottle drive, which is our biggest fundraiser. Grad council was divided into pairs, with each pair in charge of a neighborhood and counting houses and making maps. We also went through the specific day plans of what is going to go down on the days of the bottle drive. We decided that the grad swag will be MUJI pens, and that we will look into sticker printing from the university's print services because our own homemade stickers were not durable enough. Also, we began thinking about keynote speakers for the big event. I look forward to working together with grad council to make our grad amazing.",
    "dates": [
      1572588000000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "We had another grad meeting today. Today's meeting was really quick and efficient as we finished our entire agenda one hour ahead of schedule. Firstly, we went over the food sale. The food was not warm, so there was definitely a miscommunication of how the food keep warmer works. In the future, we will keep this in mind. In addition, the room reps will finalize menus faster in future food sales to prevent a backlog for ingredient lists. We discussed how sign up for bottle drive will work today, and the room reps were told to relay this to the class and bring any issues back to the next meeting. We discussed possibly Christmas charities grad might organize. I was put in charge of the grad scholarship committee. We also started thinking about some banquet themes for the future. Overall, this meeting was super super productive and I am so glad to be working with such a great group of people.",
    "dates": [
      1573196400000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Due to the now freezing weather outside, to continue more activity for CAS, as well as to stay fit, I decided to exercise on an elliptical indoors. By the end of this session, I was tired, and my legs were exhausted. An area to grow in there future is to develop my stamina and be able to sustain long periods of exercise.<br><br><img src=\"images/image72.jpg\">",
    "dates": [
      1573628400000
    ],
    "title": "Elliptical Exercise",
    "hours": 1,
    "outcomes": [
      1
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "This week was featured a slight improvement, looking at the elliptical data. Empirically, I felt like I was able to keep up my pace for much longer, hopefully throughout this experience I will be able to further improve my fitness.<br><br><img src=\"images/image107.jpg\">",
    "dates": [
      1574578800000
    ],
    "title": "Elliptical Exercise",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "After school, we set up for the career fair. Mr roles was to accompany and show a speaker around our school. Unfortunately, less students came than expected. However, the students that did come seemed to enjoy career fair and meeting all these professionals from a number of careers. To address this issue, improvements include moving to a Friday, and doing career fair earlier in the year like September. Another improvement would be adding a timer in the back for the presenters, and adding required presentations like MyBlueprint to the keynote.<br><br><img src=\"images/image73.png\"><img src=\"images/image74.jpg\">",
    "dates": [
      1575442800000
    ],
    "title": "SET Career Fair",
    "hours": 4,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "Firstly, we reflected on Career Fair, how it went, and improvements for next year. Then, we discussed the next SET event: Merry Mentorship. There was going to be a penguin relay race game. I suggested to the team that we apply the scientific method to see whether using boxes or balloons would be better for the game by trying it out. We found out that boxes worked better, so we went with that. Overall, it was a very productive SET meeting and it was great to be able to contribute.",
    "dates": [
      1575529200000
    ],
    "title": "SET Meeting",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "Wow! I really pushed myself this week and achieved quite a large improvement compared to last time. It will be interesting to see how much more I can improve in the next few weeks.<br><br><img src=\"images/image108.jpg\">",
    "dates": [
      1575788400000
    ],
    "title": "Elliptical Exercise",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "This SET event went pretty well despite some complications with scheduling that made it end up being outside. It was very cold, however lots of mentors and mentees came out to warm up over some hot chocolate and candy canes. It was great to contribute to the betterment of mental well-being at the school.<br><br><img src=\"images/image75.jpg\">",
    "dates": [
      1576134000000
    ],
    "title": "SET Merry Mentorship",
    "hours": 1,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "Today, we reflected on the food sale, which was the most successful one yet. Then, we talked more about the bottle drive, such as how we would be communicating with our groups. Then we decided to extend candygram sales to sell the rest, as the previous week lunches were really busy and quite a few people didn't have time to buy some.",
    "dates": [
      1576220400000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "Only a slight improvement in the statistics from last time, however my progress from the beginning has been quite substantial. It looks like my plan to start regularly exercising is working and I have to keep it up.<br><br><img src=\"images/image109.jpg\">",
    "dates": [
      1576998000000
    ],
    "title": "Elliptical Exercise",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "Today was the first day of our grad bottle drive. Today, I along with my partner were in charge of a group of students for one of eight neighborhoods in our city-wide bottle drive. Today, our objective was to put flyers on doors in our neighborhood to let people know about our bottle drive. In addition to communicating important details and instructions effectively to our group in the morning, we also personally ran around and flyered houses all day. By lunch time, we were finished our first area of approximately 2000 houses. Normally, groups would do one area per day, however, since our group was really fast we decided to do the second area after lunch. We finished the other area, and in finished both areas, a total of approximately 4000 houses, in 8 hours for both areas, being one of the fastest neighborhoods in the bottle drive. In addition to that, my phone recorded 30654 steps and 19.4 km much further than any runs I have participated in during cross country. Therefore, I consider it quite a significant amount of activity. I am really thankful for my partner flyering with me, as well as the speed and efficiency of my hard working group.<br><br><img src=\"images/image77.png\"/>",
    "dates": [
      1577430000000
    ],
    "title": "Grad Bottle Drive Flyering Day",
    "hours": 8,
    "outcomes": [
      2,
      5
    ],
    "type": "activity",
    "experience": "Graduation Council"
  },
  {
    "content": "The bottle drive collection days are far more difficult in comparision to the flyering day because bottles are heavy. My partner and I spent the previous afternoon calling a number of restaurants and preparing for our next steps. After explaining the plans for the day to everyone we set out early in the morning to pick up bottles and also knock on doors to ask if people would give us their bottles. My partner and I were lucky enough to find a shopping cart on the first day to help us push around the bottles and maximize efficiency. You can tell by the darkness of the sky that we truly worked hard from sunrise to sunset.<br><br><img src=\"images/image104.jpg\"/><br><br>Despite this, it was really exhausting, as not only did we have to run quite a bit but we also had to carry bottles around. We finished our section first, so we went out to help the others in our group. I believe that we worked really hard and improved through the challenge we have undertaken, having run 36772 steps and 23.2 km over these two days.<br><br><img src=\"images/image78.png\"/><br><br><img src=\"images/image79.png\"/><br><br>We also received a number of bottles from bars and restaurants, making the phone calls we made during the previous day worth it. It was truly amazing to see the sheer number of bottles that we collected as a group.<br><br><img src=\"images/image102.jpg\"/><img src=\"images/image103.jpg\"/><br><br>After collecting the bottles, we rested for a little bit before loading the trucks. Loading the trucks is truly a collaborative effort as can be seen in the video below.<br><br><iframe style=\"width: 100%; height: 320px\" src=\"https://www.youtube.com/embed/Poby7BfFyz0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><br><br>Due to our hard work we finished first on both bottle drive days, beating the other neighboorhoods in record amounts of time. Once again I would like to thank my partner because without her it would be far more difficult, or even impossible. As well, again our group showed us how teamwork and collaboration can come together to do amazing things and fundraise for grad. Overall, I believe bottle drive was a fun and unique bonding experience for all students who were involved. With all the neighboorhoods, as a class we managed to collect 203211 bottles, successfully fundraising $23419.00 for our graduation.<br><br><img src=\"images/image101.jpg\"/>",
    "dates": [
      1578121200000,
      1578207600000
    ],
    "title": "Grad Bottle Drive Bottle Collection Days",
    "hours": 15,
    "outcomes": [
      2,
      5
    ],
    "type": "activity",
    "experience": "Graduation Council"
  },
  {
    "content": "Today, I exercised later in the day as I had quite a work out with the grad bottle drive. Despite this, I did not feel as tired as last time even though I reached about the same distance as last time. This must be a sign of improvement! <br><br><img src=\"images/image110.jpg\">",
    "dates": [
      1578294000000
    ],
    "title": "Elliptical Exercise",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "For this SET meeting we planned out several Kindness week activities. For my subgroup we planned Friday's event, which was Buddy Bingo, where each person gets a piece of paper with a bingo on it, they have to get a black-out by the end of the day and hand it in. Each person who hands it in is entered in a raffle for a prize. This experience showed me the value of working together as a team to plan and organize school events.<br><br><img src=\"images/image76.png\"/>",
    "dates": [
      1578553200000
    ],
    "title": "SET Meeting",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "For this grad meeting, we reflected upon the bottle drive. Overall, it was a very successful bottle drive, it was well organized, and the groups worked efficiently, and we raised $23419.00. We noted that some improvements such as having more trucks from the bottle depots to shorten the wait time, advertising an incentive for the parent drivers, push back the start time from 9:00 am to 9:30 am to not wake people up so early. We also contemplated the idea of having another bottle drive as a way for students who want to compensate for missing the first one. We started planning the food tasting for banquet, picking dishes that are cohesive to each other, thinking of allergies we definitely need to account for, and noting the necessity of vegetarian and vegan dishes. We talked about creating a form for baby photos and grad quotes for the banquet slideshow. We reminded the room representatives to prepare for the February food sale extra early to ensure its success. Then we planned out OSA's Got Talent, a talent show. We decided to make the performers bring at least two other people, and the way we will enforce this is to make them pay for the tickets before. This makes sure that we do not lose any money. We also started thinking of concessions and interesting award ideas for the talent show. We started contacting alumni as judges, and we picked to MCs for the event. We also noted that we may have another Class Wars event later in April. We had a little extra time so we even thought over some ideas for senior week.",
    "dates": [
      1578639600000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "I saw another significant improvement in my performance today, and I have gone a further distance than I have ever before in one hour. I think I plan on continuing my biweekly indoor exercise for a while until it warms up outside.<br><br><img src=\"images/image111.jpg\">",
    "dates": [
      1579417200000
    ],
    "title": "Elliptical Exercise",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "Today, as a Grad Council, we thought of better ideas for OGT concessions. We decided on attempting a bingsu (빙수), cotton candy, and ice tea. We also decided that despite candygrams on Valentine's Day not being quite successful for the past 2 years, to continue with plans to do Brograms. As it does not cost us additional money, as we can use cards from last year, however it does have a labour cost. We also started thinking of banquet themes, as you can see in the image below:<br><br><img src=\"images/image86.jpg\"/><img src=\"images/image87.jpg\"/><img src=\"images/image88.jpg\"><img src=\"images/image89.jpg\"/><img src=\"images/image90.jpg\"/><br><br>We asked the entire council to help us out and brainstorm ideas, this way we can create a theme that will make the most people in the our graduating class happy. We also thought of when we were going to be releasing grad bucket hats and pens.",
    "dates": [
      1579849200000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "I have done even better today and I am starting to wonder if there is a limit on my improvement, I tentatively set the goal of increasing my distance by another kilometre by March, as it seems that it gets exponentially more difficult the further I  go.<br><br><img src=\"images/image112.jpg\">",
    "dates": [
      1580626800000
    ],
    "title": "Elliptical Exercise",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "Finally at last the Student Engagement Team Mentorship Program comes to a close with the last SET event of the year! We celebrated the success of the mentorship program in the auditorium and gave all of the mentors and mentees ice cream sandwiches. This event was fairly well organized and everyone was really happy and had a good time enjoying and reflecting upon their mentorship experiences. This is a clear example of how the good choices and actions in the ethical planning of the mentorship program events resulted in clear benefits for the people that were involved. I handed out mentorship certificates to my small group following this event. It has been amazing experience to go from receiving a mentorship certificate to be the one handing them out.<br><br><img src=\"images/image80.jpg\"/>",
    "dates": [
      1581058800000
    ],
    "title": "SET Mentorship Celebration",
    "hours": 1,
    "outcomes": [
      4,
      7
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "For this grad meeting we came up with a plan for how we would sell the grad branded bucket hats. We spent the majority of the meeting planning OSA's Got Talent. We decided to have a test kitchen next meeting to decide on how concessions would be done. We assigned certain people tasks of bringing ingredients for the test kitchen. We looked over mood boards created by Grad Council members to dicuss what we would like to have for banquet.<br><br><img src=\"images/image92.jpg\"><img src=\"images/image93.jpg\"><img src=\"images/image94.jpg\"><img src=\"images/image95.jpg\"><img src=\"images/image96.jpg\"><img src=\"images/image97.jpg\"><br><br>We decided that we would have a green and gold colour scheme, potentially do clear balloons with glitter inside, have some photobooth props, have fancy table number cards, and try our best to do have fancy center pieces. Overall, it was clear that collaboration and working together would be necessary to making this the best grad banquet possible!",
    "dates": [
      1581058800000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "At last, we have come to the last SET meeting of the year. We reflected on our events such as each day of Kindness Week and the Mentorship Celebration. For Buddy Bingo, we suggested a number of improvements for next year's Student Engagement Team including: having a collection box, and getting all four council execs onto the bingo board. Overall, the event was very engaging, and it made the different grades talk to each other! Mentorship Celebration was a success, the only thing that might improve for next year would be to perhaps remove the seating plan system, as it took a long time for people to find their seats. Then, we discussed our entire year as a whole as a SET team and we gave gifts and cards to our advisors and executives. It was incredible to see how much progress we have made as a team since the beginning.<br><br><img src=\"images/image81.jpg\"/><img src=\"images/image82.jpg\"/><img src=\"images/image83.jpg\"/>",
    "dates": [
      1581577200000
    ],
    "title": "SET Meeting",
    "hours": 1,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Student Engagement Team"
  },
  {
    "content": "Another slight improvement in distance over last time. This week it felt much easier to run the same amount, which is good. Hopefully I can maintain this routine exercise for a long time.<br><br><img src=\"images/image113.jpg\">",
    "dates": [
      1581836400000
    ],
    "title": "Elliptical Exercise",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "We had our test kitchen, which took a rather long time and was not as organized as it could have been. However, from the testing, we were able to figure out the concessions for OSA's Got Talent, as we plan to serve red bean ice (紅豆冰) and curry fish balls (咖喱魚蛋), branding this as Grad Council's first dim sum cart. We also determined prices as a council to ensure that the concessions would be a success. The remainder of the meeting was very quick and well organized. We finalized the prizes for OSA's Got Talent, and assigned roles for the talent show to make sure we were organized and ready. We discussed the banquet food tasting as well, which would be occuring sometime next week, so we could try out the banquet menu and make any necessary changes prior to the actual grad banquet.",
    "dates": [
      1582268400000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "For this year OSA's Got Talent went splendidly. I mostly attribute this to as a Grad Council applying our experiences from last year. As well, we were fortunate to have a number of students in musical theatre on council, who could be considered experts in the field. Thus, through good role designation we were able to host a great talent show fundraiser. It was great to see all the performers enjoying themselves and the audience watching intently. We noted that the turn out was better than last year, but could still be further improved. In addition, we also noticed that we should select judges more carefully, as a bit too many times the judges were lost for words.<br><br><img src=\"images/image105.jpg\"/><br><br>In addition, we also sold food and turned a profit at Grad Council's first ever dim sum cart fundraiser during this event.<br><br><img src=\"images/image91.png\">",
    "dates": [
      1582700400000
    ],
    "title": "OSA's Got Talent",
    "hours": 2,
    "outcomes": [
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "I can't believe that is March already, and that I am on the last month of my CAS journey. Today marked another improvement, I got really close to achieving the goal to run one kilometre more than I did in February, hopefully I can achieve that next week.<br><br><img src=\"images/image114.jpg\">",
    "dates": [
      1583046000000
    ],
    "title": "Elliptical Exercise",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "After reflecting upon our choices from food tasting day, we went on to discuss decorations for banquet, including: tea lights, candles, vases, lanterns, flowers, a flower wall, table number holders, and mason jars. We looked in depth on the costs and logistics of flowers. <img src=\"images/image98.jpg\"><br><br>We considered looking into doing another dim sum cart fundraiser as well. We started discussing the dates and plans for the next Class Wars as well. This meeting has set us up for success in the future.",
    "dates": [
      1583478000000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 1,
    "outcomes": [
      3,
      4,
      5
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "For this enjoyable meeting, we listened to a number of grad speech auditions and began a selection process for speakers for  banquet MCs, toast to teachers, toast to parents, as well as commencement MCs, and class historians. We also looked into a number of flower samples from the florist.<br><br><img src=\"images/image100.jpg\"><br><br>We even created our own arrangement from the flowers in the three arrangements that we decided on. We also looked into using the mason jars we already had as vases since they were smaller and the flowers looked better in them. We decided on a white table cloth colour, with forest green napkins. <br><br><img src=\"images/image99.png\"><br><br> We also started looking into a grad gift to the school for our year. We also brought up the idea of cookie dough fundraising in collaboration with Athletics Council to help students who did not attend bottle drive fundraiser in a fair manner. This was the solution we came up with to have the fairest and most ethical way of distributing the money fundraised from bottle drive. Unfortunately, we had to cancel the upcoming class war over concerns with COVID-19. We also started working on our compliment card initiative, to give people the opportunity to deliver nice messages to the graduates.<br><br>Because this was the last meeting prior to classes being cancelled due to the COVID-19 pandemic, the supervisor evaluation form is below. Despite the situation, our job as a Grad Council is not done and we will continue to strive to create a great graduation experience regardless of the circumstances while respecting social distancing requirements by having online meetings. However, from this point forward, the following meetings are out of the scope of CAS.<img src=\"images/image106.jpg\">",
    "dates": [
      1584079200000
    ],
    "title": "Grad Council 2020 Meeting",
    "hours": 2,
    "outcomes": [
      3,
      4,
      5,
      7
    ],
    "type": "service",
    "experience": "Graduation Council"
  },
  {
    "content": "I got so close to completing the goal, unfortunately I was only 0.1 km away. Oh well, over the span of this elliptical exercise series I managed to have quite a substantial improvement from the first time, it is an almost 6 km improvement in distance from November.<br><br><img src=\"images/image115.jpg\">",
    "dates": [
      1584252000000
    ],
    "title": "Elliptical Exercise",
    "hours": 1,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "School was indefinitely cancelled yesterday to slow down the community spread of COVID-19. This means that I won't be travelling to school anymore for the next while. So to remain somewhat fit and prevent myself from becoming an absolute slouch I decided to run 30 minutes three days of a week until social distancing is complete.<br><br><img src=\"images/image116.jpg\"><img src=\"images/image117.jpg\"><img src=\"images/image118.jpg\">",
    "dates": [
      1584338400000,
      1584511200000,
      1584684000000
    ],
    "title": "Elliptical Exercise",
    "hours": 1.5,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "I found that running on the elliptical for exercise three times a week was really good for keeping me energized during the day. This week I found substantial improvement over last week, showing that I had improved to the point of running almost two kilometres more in half an hour than at the beginning last week. With this being my final CAS reflection, I just wanted to add that out of the three strands, the relative improvement in my levels of activity from prior till CAS compared to now was really substantial and helped me round myself out.<br><br><img src=\"images/image119.jpg\"><img src=\"images/image120.jpg\"><img src=\"images/image121.jpg\">",
    "dates": [
      1584943200000,
      1585116000000,
      1585288800000
    ],
    "title": "Elliptical Exercise",
    "hours": 1.5,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "activity",
    "experience": "Elliptical Exercise"
  },
  {
    "content": "Wow I have made it till the end, and I just wrote my final CAS reflection. I can't believe how far I come not only in all three of the strands of CAS: creativity activity, and service, but also how much I have developed as an individual. I have developed so many skills and had so many memorable experiences. Overall, CAS was quite the journey and I hope you enjoyed reading through all of my reflections.",
    "dates": [
      1585634400000
    ],
    "title": "CAS Final Reflection",
    "hours": 0,
    "outcomes": [
      1,
      2,
      4
    ],
    "type": "CAS",
    "experience": null
  }
]